/*
算数运算符
	+, -, *, /, ++, --
关系运算符
	>,  >=, <, <=, ==, !=
逻辑运算符
	&& : 与; a && b 表示 a 与 b 同时为 true, 结果为true, 否决结果是 false;
	|| : 或; a || b 表示 a 或 b 都为 false时, 结果为 false, 否则结果是 true;
	!  : 非; !a 表示如果 a == true, 那么 !a == false;
位运算符
	&   : 按位与; 两个位都为1时，结果才为1;
	|   : 按位或; 两个位都为0时，结果才为0;
	^   : 按位异或; 两个位相同为0，相异为1;
	~(a ^ b): 按位同或; 相同为1，相异为0;(因为本身没有异或, 所以这样表示)
	~   : 按位取反; 0 变成 1, 1 变成 0;
	<<  : 算数左移; 各二进位全部左移若干位，高位丢弃，低位补0;
	>>  : 算数右移; 各二进位全部右移若干位，对无符号数高位补0，有符号数补符号位;
	>>> : 逻辑右移; 各二进位全部右移若干位，高位补0;
	没有 <<<(逻辑左移) 运算符;
赋值运算符
	=, +=, -=, *=, /=, %=, &=, |=, ^=, ~=, <<=, >>=, >>>=
其他运算符
	& : 取地址运算符(指针中使用);
	* : 取值运算符(指针中使用);
运算符优先级
**/
package main

func main() {

}
